tutorials/simple4MLFoam/channel/constant/dataSet
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dataSet;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

trainingData
(
//((T alpha) (rho Cp k mu))
((308.0 0.004) (998.1 3520 0.66 0.76e-3))
((308.0 0.005) (999 3350 0.671 0.768e-3))
((333.0 0.002) (985.3 3940 0.701 0.47e-3))
((333.0 0.003) (986.4 3840 0.713 0.474e-3))
((303.0 0.001) (996.8 3800 0.626 0.81e-3))
((303.0 0.002) (997.7 3720 0.634 0.819e-3))
((308.0 0.001) (995.2 3830 0.635 0.731e-3))
((308.0 0.002) (996.1 3750 0.642 0.74e-3))
((308.0 0.003) (997 3640 0.65 0.75e-3))
((333.0 0.001) (984.3 4040 0.687 0.466e-3))
((333.0 0.004) (987.4 3690 0.724 0.478e-3))
((333.0 0.005) (988.5 3550 0.746 0.481e-3))
((313.0 0.004) (996.2 3560 0.67 0.685e-3))
((313.0 0.005) (997.1 3390 0.689 0.694e-3))
((323.0 0.001) (989.1 3970 0.662 0.555e-3))
((323.0 0.002) (990 3850 0.674 0.561e-3))
((303.0 0.003) (998.7 3610 0.642 0.83e-3))
((303.0 0.004) (999.7 3490 0.649 0.84e-3))
((303.0 0.005) (1000.6 3310 0.656 0.85e-3))
((328.0 0.002) (987.7 3890 0.687 0.516e-3))
((328.0 0.003) (988.6 3780 0.698 0.52e-3))
((328.0 0.004) (989.5 3650 0.708 0.526e-3))
((313.0 0.001) (993.3 3890 0.644 0.664e-3))
((313.0 0.002) (994.2 3780 0.652 0.672e-3))
((313.0 0.003) (995.2 3680 0.658 0.679e-3))
((323.0 0.003) (990.9 3740 0.682 0.566e-3))
((323.0 0.004) (991.9 3610 0.693 0.572e-3))
((323.0 0.005) (992.9 3480 0.718 0.58e-3))
((318.0 0.003) (993.1 3720 0.67 0.618e-3))
((318.0 0.004) (994.1 3580 0.681 0.624e-3))
((318.0 0.005) (995.1 3440 0.702 0.632e-3))
((328.0 0.001) (986.5 4000 0.671 0.51e-3))
((328.0 0.005) (990.6 3520 0.732 0.534e-3))
((318.0 0.001) (991.2 3940 0.652 0.605e-3))
((318.0 0.002) (992.2 3810 0.663 0.612e-3))
);

/*
trainingData
(
//((T alpha) (rho Cp k mu))
((303.0 0.001) (996.8 3800 0.626 0.81e-3))
((303.0 0.002) (997.7 3720 0.634 0.819e-3))
((303.0 0.003) (998.7 3610 0.642 0.83e-3))
((303.0 0.004) (999.7 3490 0.649 0.84e-3))
((303.0 0.005) (1000.6 3310 0.656 0.85e-3))

((308.0 0.001) (995.2 3830 0.635 0.731e-3))
((308.0 0.002) (996.1 3750 0.642 0.74e-3))
((308.0 0.003) (997 3640 0.65 0.75e-3))
((308.0 0.004) (998.1 3520 0.66 0.76e-3))
((308.0 0.005) (999 3350 0.671 0.768e-3))

((313.0 0.001) (993.3 3890 0.644 0.664e-3))
((313.0 0.002) (994.2 3780 0.652 0.672e-3))
((313.0 0.003) (995.2 3680 0.658 0.679e-3))
((313.0 0.004) (996.2 3560 0.67 0.685e-3))
((313.0 0.005) (997.1 3390 0.689 0.694e-3))

((318.0 0.001) (991.2 3940 0.652 0.605e-3))
((318.0 0.002) (992.2 3810 0.663 0.612e-3))
((318.0 0.003) (993.1 3720 0.67 0.618e-3))
((318.0 0.004) (994.1 3580 0.681 0.624e-3))
((318.0 0.005) (995.1 3440 0.702 0.632e-3))

((323.0 0.001) (989.1 3970 0.662 0.555e-3))
((323.0 0.002) (990 3850 0.674 0.561e-3))
((323.0 0.003) (990.9 3740 0.682 0.566e-3))
((323.0 0.004) (991.9 3610 0.693 0.572e-3))
((323.0 0.005) (992.9 3480 0.718 0.58e-3))

((328.0 0.001) (986.5 4000 0.671 0.51e-3))
((328.0 0.002) (987.7 3890 0.687 0.516e-3))
((328.0 0.003) (988.6 3780 0.698 0.52e-3))
((328.0 0.004) (989.5 3650 0.708 0.526e-3))
((328.0 0.005) (990.6 3520 0.732 0.534e-3))

((333.0 0.001) (984.3 4040 0.687 0.466e-3))
((333.0 0.002) (985.3 3940 0.701 0.47e-3))
((333.0 0.003) (986.4 3840 0.713 0.474e-3))
((333.0 0.004) (987.4 3690 0.724 0.478e-3))
((333.0 0.005) (988.5 3550 0.746 0.481e-3))
);
*/
testingData
(

);


